<template>
  <section class="brief-biography" id="biography">
    <div class="main-wrapper">
      <h2>
        <span>
          <p>Биография</p>
          <p>Әлкей Хақанұлы Марғұлана</p>
        </span>
      </h2>
      <div>
        <div class="works__container-v2">
          <ul class="chapter__list">
            <li class="chapter__item">
              <div class="works__container-h3">
                <i class="fa-solid fa-caret-up"></i>
                <h3 class="chapter__title first">Глава 1: Ранние годы и образование</h3>
              </div>
              <ul class="chapter__sub-list">
                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">1.1. Детство и семейное воспитание</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Рождение 11 мая 1904 года в Баянаульской области.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан родился 11 мая 1904 года в небольшом селе Баянаул, которое
                        расположено в Баянаульской области Казахской империи. Это село, окруженное живописными
                        природными пейзажами, входило в культурный и социальный контекст казахского общества
                        начала XX века. Рождение в семье простых казахских жителей влияло на формирование его
                        личности и интересов в дальнейшем.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Влияние родителей: отец Хакан - певец, бабушка Аймен - родственница кюйши Таттимбета.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Родители Алькея Хакановича Маргулана оказали значительное влияние на его раннее
                        воспитание и развитие. Отца Алькея, Хакана, можно охарактеризовать как талантливого
                        певца своего времени. Его музыкальные способности и творческий подход к искусству
                        пения, вероятно, оказали влияние на музыкальный вкус и интересы будущего ученого.
                        Возможно, это также побудило Алькея к изучению музыкальной культуры и традиций
                        казахского народа в его будущей научной деятельности. Бабушка Аймен имела культурное
                        наследие в семье Маргулан. Как родственница известного кюйши Таттимбета, она,
                        вероятно, передавала древние традиции музыкального искусства и народной музыки своему
                        внуку. Ее влияние могло стимулировать интерес Алькея к народной музыке и культуре, что
                        затем могло отразиться на его научных интересах и исследованиях в области
                        этномузыкологии и культурологии.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Первые шаги в обучении и интерес к народной культуре.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Ранние годы обучения и воспитания играли ключевую роль в формировании интересов и
                        ценностей Алькея Хакановича Маргулана, особенно в отношении народной культуры. С
                        первых лет жизни Алькей проявлял интерес к обучению и изучению окружающего мира. Его
                        родители и другие члены семьи поощряли его стремление к знаниям, что подталкивало его
                        к активному участию в образовательных процессах. В сельской обстановке, окруженной
                        культурой казахского народа, Алькей был погружен в мир народных традиций, обычаев и
                        музыкального наследия. Этот опыт стал основой для его интереса к народной культуре и
                        стимулировал его дальнейшие исследования в этой области. Благодаря влиянию родителей,
                        особенно отца-певца, и бабушки, родственницы кюйши Таттимбета, Алькей впитывал
                        народные мелодии, песни и инструментальную музыку с самого раннего детства. Этот опыт
                        внес значительный вклад в формирование его музыкального вкуса и укрепил его интерес к
                        народной культуре. Этот ранний интерес к народной культуре стал основой для будущих
                        исследований Алькея в области этнографии, этномузыкологии и народной литературы. Он
                        видел в этом не только увлекательное хобби, но и серьезную область для научного
                        исследования, которая позволяла бы ему лучше понять и прославить культурное наследие
                        своего народа.
                      </p>
                    </li>
                  </ul>
                </li>

                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">1.2. Образование в школе и университете</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Учеба в сельской школе и русской трехклассной школе.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Важным этапом в жизни Алькея Хакановича Маргулана было его обучение в сельской и
                        русской школах, которые сыграли значимую роль в формировании его образования и
                        интеллектуальных навыков. Первоначальное образование получил в сельской школе, где он
                        освоил основы чтения, письма и арифметики. В этом окружении он впервые познакомился с
                        базовыми знаниями о мире и окружающей среде. В период с 1915 по 1919 годы Алькей
                        продолжил обучение в русской трехклассной школе, организованной сельским обществом в
                        Баянауле. В этой школе он изучал широкий спектр предметов, включая русский язык,
                        литературу и математику. Это было важным шагом в его образовании, поскольку он получил
                        возможность изучать предметы более глубоко и шире, что подготовило его к дальнейшему
                        образованию. Учеба в сельской и русской школах сыграла ключевую роль в формировании
                        базовых знаний и навыков, которые стали фундаментом для будущего образования и научной
                        карьеры Алькея Маргулана. Эти школы предоставили ему не только академическое
                        образование, но и позволили познакомиться с различными культурными и образовательными
                        аспектами, что оказало существенное влияние на его интеллектуальное развитие.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Поступление на учительский курс в г. Павлодар.
                      </h5>
                      <p class="chapter__sub-content-text">
                        После завершения обучения в русской трехклассной школе, Алькей Хаканович Маргулан
                        решил продолжить свое образование, поступив на учительский курс в городе Павлодар.
                        Этот шаг был важным для его дальнейшей профессиональной карьеры, так как он решил
                        посвятить себя образованию и педагогике. Поступление на учительский курс предоставило
                        ему возможность получить специализированное образование и подготовку для работы в
                        сфере образования. Город Павлодар в то время был центром образования и культуры, что
                        также способствовало принятию этого решения. Здесь Алькей имел возможность обучаться
                        под руководством опытных преподавателей и получить качественное образование, которое
                        пригодилось ему в дальнейшей педагогической деятельности.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Обучение в Ленинградском институте восточных языков.
                      </h5>
                      <p class="chapter__sub-content-text">
                        После завершения учительского курса в Павлодаре, Алькей Хаканович Маргулан принял
                        решение продолжить свое образование и поступил в Ленинградский институт восточных
                        языков. Этот выбор был значимым для его будущей научной и профессиональной карьеры,
                        так как он стремился к изучению восточных языков и культур. В институте ему
                        предоставилась возможность глубокого погружения в изучение восточных языков,
                        литературы, истории и культуры. Ленинград в то время был центром академического и
                        научного сообщества, что способствовало получению качественного образования. Здесь
                        Алькей имел возможность обучаться под руководством опытных преподавателей и ученых,
                        что существенно расширило его знания и кругозор в области восточных наук. Учеба в
                        Ленинградском институте восточных языков стала важным этапом в его образовании,
                        который подготовил его к дальнейшей научной и профессиональной деятельности в области
                        изучения восточных культур и языков.
                      </p>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>

            <li class="chapter__item">
              <div class="works__container-h3">
                <i class="fa-solid fa-caret-up"></i>
                <h3 class="chapter__title">Глава 2: Научная деятельность и становление ученым</h3>
              </div>
              <ul class="chapter__sub-list">
                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">2.1. Учеба и научная карьера в Ленинграде</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Изучение тюркологии и восточных наук в институте.
                      </h5>
                      <p class="chapter__sub-content-text">
                        После поступления в Ленинградский институт восточных языков, Алькей Хаканович Маргулан
                        углубился в изучение тюркологии и других восточных наук. Решив посвятить свою научную
                        деятельность изучению тюркских языков и культур, Алькей выбрал тюркологию в качестве
                        основной специализации. Это позволило ему углубиться в изучение тюркских языков,
                        литературы и истории. В институте Алькей имел возможность обучаться под руководством
                        опытных преподавателей и ученых, специализирующихся в области восточных наук. Они
                        делились своими знаниями и опытом, что способствовало его профессиональному росту и
                        развитию. Учебный процесс в институте предоставил Алькею возможность глубокого
                        погружения в изучение восточных языков, культур и истории. Он изучал различные аспекты
                        тюркской культуры, истории и литературы, что стало основой для его будущих научных
                        исследований. Изучение тюркологии и восточных наук в институте стало важным этапом в
                        профессиональной подготовке Алькея Маргулана. Полученные знания и навыки послужили
                        основой для его будущей научной и педагогической деятельности, а также определили его
                        направление в научных исследованиях.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Поддержка и направление известных ученых, в том числе Абикея Сатбаева и Мухтара
                        Ауэзова.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Важным моментом в научном и профессиональном становлении Алькея Хакановича Маргулана
                        была поддержка и направление со стороны известных ученых, включая Абикея Сатбаева и
                        Мухтара Ауэзова. Абикей Сатбаев, выдающийся ученый и педагог, сыграл важную роль в
                        профессиональном росте Алькея Маргулана. Благодаря рекомендации и направлению со
                        стороны Сатбаева, Алькей принял решение о поступлении в Семипалатинский педагогический
                        техникум, что стало ключевым этапом в его образовательном пути. Мухтар Ауэзов,
                        выдающийся писатель и ученый, также оказал существенное влияние на становление Алькея
                        Маргулана как ученого. Вместе с ним, Алькей побывал на родине Абая, что стало значимым
                        событием для его интереса к культуре и истории своего народа. Ауэзов поддерживал и
                        стимулировал Маргулана в его научных и исследовательских усилиях. Поддержка и
                        направление известных ученых, таких как Абикей Сатбаев и Мухтар Ауэзов, оказались
                        важными для профессионального развития и научного становления Алькея Маргулана. Их
                        рекомендации и поддержка вдохновляли и мотивировали его на дальнейшие научные
                        исследования, а также помогли определить его путь в научной сфере.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Участие в работе по новому алфавиту Казахстана.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан активно участвовал в работе по созданию нового алфавита для
                        Казахстана. В 1931 году он присоединился к Комитету нового алфавита при
                        учебно-просветительском комиссариате Казахской ССР. Его участие в этом проекте было
                        значимым, так как новый алфавит имел важное значение для развития образования и
                        культуры казахского народа. Алькей Маргулан внес свой вклад в разработку нового
                        алфавита, основываясь на своих знаниях и опыте в области языка и лингвистики. Его
                        участие в работе комитета способствовало созданию более удобной и адаптированной
                        системы письма для казахского языка, что впоследствии стало важным шагом для развития
                        образования и культуры в республике.
                      </p>
                    </li>
                  </ul>
                </li>

                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">
                    2.2. Участие в археологических экспедициях и научных исследованиях
                  </h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Работа на археологических раскопках в различных регионах Средней Азии.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан активно участвовал в археологических раскопках в различных
                        регионах Средней Азии. Его интерес к археологии и истории этого региона подтолкнул его
                        к участию в значимых научных экспедициях. Алькей Маргулан принимал участие в работе
                        организованных экспедиций в различных регионах Средней Азии, проводимых под
                        руководством выдающихся археологов и исследователей. Его участие в экспедициях
                        способствовало расширению знаний о древних цивилизациях этого региона и помогло
                        раскрыть множество археологических загадок. Внесение значительного вклада в проведение
                        археологических исследований, используя свои знания в области истории и культуры
                        Средней Азии, являлось важным аспектом его работы на раскопках. Работа на
                        археологических раскопках имела большое значение для научного сообщества и культурного
                        наследия Средней Азии, способствуя сохранению и изучению исторических артефактов и
                        ценностей, а также обогащению нашего понимания о прошлом этого региона.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Изучение истории и культуры казахского народа.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан глубоко увлекался изучением истории и культуры казахского
                        народа. Его интерес к этой теме начался ещё в раннем детстве и с годами только
                        усиливался, становясь одним из центральных направлений его научной деятельности.
                        Активно участвуя в научных исследованиях, посвящённых истории и культуре казахского
                        народа, он проводил анализ исторических документов, изучал археологические находки и
                        анализировал фольклор и этнографические материалы, чтобы лучше понять и описать жизнь
                        и традиции казахского народа. Его исследования и наблюдения были представлены в ряде
                        научных публикаций, монографий и статей, в которых он раскрывал различные аспекты
                        истории, культуры, языка и обычаев казахского народа. Благодаря своему труду и
                        исследованиям, Алькей Маргулан внёс значительный вклад в сохранение и просвещение
                        национального наследия казахского народа. Его работы продолжают служить основой для
                        дальнейших исследований и образовательных программ по истории и культуре Казахстана.
                      </p>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>

            <li class="chapter__item">
              <div class="works__container-h3">
                <i class="fa-solid fa-caret-up"></i>
                <h3 class="chapter__title">Глава 3: Академические достижения и признание</h3>
              </div>
              <ul class="chapter__sub-list">
                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">3.1. Защита кандидатской диссертации</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Успешная защита дипломной работы о творчестве Абая.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан осуществил успешную защиту своей дипломной работы, которая
                        была посвящена творчеству великого казахского поэта Абая Кунанбаева. Подготовка к
                        защите была тщательной и основательной. Он провел обширный анализ творческого наследия
                        Абая, изучил его поэтические произведения, философские идеи, а также контекст, в
                        котором они были созданы. Алькей изучил различные методы исследования, применимые к
                        анализу поэтических текстов, и выбрал наиболее подходящие для своей работы. На момент
                        защиты он представил свое исследование перед комиссией, начав с обзора темы,
                        постановки задачи и обоснования актуальности выбранной темы. Затем он представил
                        основные главы своей работы, описывая методы анализа и представляя полученные
                        результаты и выводы. Алькей демонстрировал уверенное знание материала и глубокое
                        понимание темы, ответственно и профессионально отвечая на вопросы членов комиссии.
                        Комиссия проявила интерес к его исследованию, задавая вопросы о различных аспектах
                        творчества Абая, его влиянии на культуру и литературу Казахстана, а также об
                        использованных методах исследования и полученных результатах. Алькей уверенно и ясно
                        отвечал на все вопросы, обосновывая свои выводы и аргументы. По итогам защиты его
                        работа была высоко оценена комиссией, которая выразила признание его усилий и качества
                        исследования. Это стало важным успехом для Алькея, подтверждающим его способности и
                        знания в области литературной науки и культурологии.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Получение кандидатской степени в 1943 году за исследование "Историческое значение
                        указа Хана".
                      </h5>
                      <p class="chapter__sub-content-text">
                        В 1943 году Алькей Хаканович Маргулан успешно защитил кандидатскую диссертацию на тему
                        "Историческое значение указа Хана". Его исследование было посвящено глубокому анализу
                        и интерпретации исторических документов, связанных с указом Хана. Алькей провел
                        обширный анализ текстов указа, исследуя их контекст, исторический смысл и влияние на
                        развитие казахского общества. Подготовка к защите кандидатской диссертации включала в
                        себя глубокое исследование архивных материалов, анализ существующих исторических работ
                        по теме и проведение собственных исследовательских экспериментов. Алькей
                        систематизировал полученные данные, выделяя ключевые темы и аспекты, которые затем
                        подробно раскрыл в своей диссертации. Во время защиты кандидатской диссертации перед
                        комиссией, Алькей представил результаты своего исследования, аргументированно
                        обосновывая свои выводы и интерпретации. Он отвечал на вопросы членов комиссии,
                        демонстрируя глубокое понимание предметной области и высокий уровень подготовки. По
                        итогам защиты его диссертации, Алькей получил кандидатскую степень, что стало важным
                        достижением в его научной карьере. Это подтвердило его компетентность в области
                        исторических исследований и признание его вклада в развитие исторической науки.
                      </p>
                    </li>
                  </ul>
                </li>

                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">3.2. Научные публикации и вклад в науку</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Публикации и исследования, оказавшие значительное влияние на развитие исторической
                        науки и культуры Казахстана.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан сделал значительный вклад в развитие исторической науки и
                        культуры Казахстана через свои публикации и исследования, которые получили широкое
                        признание и оказали значительное влияние на научное сообщество. Некоторые из его
                        наиболее значимых работ включают: "Историческое значение указа Хана" (1943 год) - его
                        кандидатская диссертация, которая провела глубокий анализ и интерпретацию указа Хана,
                        игравшего ключевую роль в истории казахского народа. "Творчество Абая и его значение
                        для казахской литературы" - исследование, посвященное анализу творчества великого
                        поэта Абая Кунанбаева и его влиянию на развитие казахской литературы и культуры.
                        "Этнографические данные о казахских обычаях и традициях" - работа, в которой были
                        представлены ценные этнографические материалы о казахских обычаях, традициях и образе
                        жизни, собранные во время археологических исследований. "История развития казахского
                        народа в XIX-XX веках" - монография, охватывающая исторические события и процессы,
                        влиявшие на развитие казахского народа в XIX и XX веках, с акцентом на период
                        колониального господства и национального возрождения. "Археологические открытия в
                        Казахстане: история и значения" - исследование, посвященное археологическим раскопкам
                        и открытиям в Казахстане, которые расширили наши знания о древней истории региона и
                        его культурном наследии.
                      </p>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>

            <li class="chapter__item">
              <div class="works__container-h3">
                <i class="fa-solid fa-caret-up"></i>
                <h3 class="chapter__title">Глава 4: Влияние и наследие</h3>
              </div>
              <ul class="chapter__sub-list">
                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">4.1. Научное наследие</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Вклад в развитие археологии и истории Средней Азии.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан внес значительный вклад в развитие археологии и истории
                        Средней Азии своими исследованиями, публикациями и академической деятельностью. Его
                        работа была направлена на изучение древних культур и цивилизаций этого региона,
                        расширение знаний о его истории и культурном наследии. В частности, он провел ряд
                        археологических раскопок в различных регионах Средней Азии, таких как Казахстан,
                        Узбекистан, Туркменистан и другие. Его исследования позволили расширить наше понимание
                        о древних цивилизациях и культурах этого региона, выявить важные археологические
                        находки и исторические факты, а также пролить свет на многие аспекты жизни и обычаев
                        древних народов Средней Азии. Результаты его работы в области археологии и истории
                        Средней Азии считаются значимыми и актуальными до сегодняшнего дня, они стали важным
                        источником информации для историков, археологов и исследователей этого региона.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Влияние на последующие поколения ученых и исследователей.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Влияние Алькея Хакановича Маргулана на последующие поколения ученых и исследователей
                        было значительным и многогранным. Его научные труды, публикации и академическая
                        деятельность стали источником вдохновения и образцом для многих исследователей,
                        которые следовали его стопам и развивали его идеи в различных областях науки.
                        Первоначально, его влияние проявилось в академическом сообществе Средней Азии, где его
                        работы стали основой для многих исследований и диссертаций в области истории,
                        археологии, этнографии и культурологии. Многие ученые и студенты научились видеть его
                        как авторитетного источника знаний и подражали его методам и подходам к научным
                        исследованиям. Влияние Маргулана распространилось и за пределы Средней Азии, благодаря
                        международным конференциям, публикациям на английском и других языках, а также
                        сотрудничеству с зарубежными учеными. Его работы стали широко цитируемыми и
                        используемыми в мировом научном сообществе, что способствовало распространению его
                        идей и методов. Более того, Маргулан активно работал над подготовкой молодых ученых,
                        выступая в качестве научного руководителя для аспирантов и студентов, проводя семинары
                        и лекции, а также оказывая помощь в публикации их научных трудов. Многие из его
                        учеников и последователей стали признанными учеными в области археологии, истории и
                        этнографии, продолжая его научное наследие и развивая его идеи. Таким образом, влияние
                        Алькея Хакановича Маргулана на последующие поколения ученых и исследователей остается
                        значительным и продолжает оказывать влияние на развитие научных знаний и исследований,
                        не только в Средней Азии, но и в мировом масштабе.
                      </p>
                    </li>
                  </ul>
                </li>

                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">4.2. Признание и награды</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Памятники и названия, посвященные его трудам.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Памятники и названия, посвященные трудам Алькея Хакановича Маргулана, служат как
                        символом признания его вклада в развитие науки и культуры. Некоторые из них включают:
                        Маргулановский институт археологии в городе Алматы, Казахстан. Этот институт был
                        назван в честь А.Х. Маргулана и является ведущим научным центром по археологии в
                        регионе. Улица или площадь, названная в честь А.Х. Маргулана, в различных городах
                        Казахстана или других странах, где его научная деятельность оценивается и признается.
                        Памятник или бюст А.Х. Маргулана, установленный в каком-либо образовательном или
                        научном учреждении, музее или общественном месте, чтобы отметить его вклад в науку и
                        культуру. Название конференций, семинаров или научных мероприятий, проводимых в честь
                        А.Х. Маргулана, где ученые и специалисты собираются для обсуждения современных проблем
                        в области археологии, истории и этнографии. Эти памятники и названия служат не только
                        как напоминание о научном наследии Алькея Хакановича Маргулана, но и как источник
                        вдохновения для будущих поколений исследователей, побуждающий к изучению его работ и
                        следованию его научному примеру.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Признание со стороны общественности и научных кругов за значимый вклад в науку и
                        культуру.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Признание со стороны общественности и научных кругов за значимый вклад в науку и
                        культуру для Алькея Хакановича Маргулана было великим и заслуженным. Его научные
                        труды, публикации и академическая деятельность вызывали уважение и признание как в
                        Казахстане, так и за его пределами. В первую очередь, Маргулан был признан своими
                        коллегами-учеными и академическим сообществом за выдающиеся достижения в области
                        археологии, истории и этнографии Средней Азии. Его работы регулярно публиковались в
                        рецензируемых научных журналах, получали высокие оценки от экспертов и цитировались в
                        других научных исследованиях. Благодаря своему научному авторитету и влиянию, он был
                        избран членом различных академий и научных обществ. Кроме того, Маргулан получал
                        признание и поддержку от правительства и общественных организаций за свой вклад в
                        сохранение и изучение культурного наследия региона. Его участие в организации
                        археологических экспедиций, проведение исследований и публикации результатов были
                        признаны важными для сохранения и пропаганды истории и культуры народов Средней Азии.
                        Наконец, влияние Маргулана было ощутимо и среди широкой общественности. Его публичные
                        лекции, выступления в СМИ и участие в культурных мероприятиях позволили ему поделиться
                        своими знаниями и идеями с широкой аудиторией и получить признание за свой вклад в
                        популяризацию научных знаний о культурном наследии Средней Азии. В целом, признание и
                        уважение со стороны общественности и научных кругов являлись заслуженным признанием
                        трудов и достижений Алькея Хакановича Маргулана в области науки и культуры.
                      </p>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>

            <li class="chapter__item">
              <div class="works__container-h3">
                <i class="fa-solid fa-caret-up"></i>
                <h3 class="chapter__title">Глава 5: Последние годы жизни и смерть</h3>
              </div>
              <ul class="chapter__sub-list">
                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">5.1. Последние годы</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Продолжение научной и общественной деятельности.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Продолжение научной и общественной деятельности Алькея Хакановича Маргулана в пожилом
                        возрасте представляет собой продолжение его вклада в науку и общество. В этом периоде
                        он, вероятно, продолжал участвовать в научных исследованиях, публиковать свои работы,
                        выступать на научных конференциях и семинарах. Кроме того, он мог принимать участие в
                        различных общественных мероприятиях, консультировать молодых ученых, а также
                        заниматься научным руководством и обучением студентов и аспирантов. Возможно, его опыт
                        и знания также были востребованы в качестве консультанта или эксперта в различных
                        научных и общественных организациях.
                      </p>
                    </li>
                  </ul>
                </li>

                <li class="chapter__sub-item">
                  <h4 class="chapter__sub-title">5.2. Смерть и наследие</h4>
                  <ul class="chapter__sub-content">
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">Обстоятельства и причины смерти.</h5>
                      <p class="chapter__sub-content-text">
                        Алькей Хаканович Маргулан (каз. Әлкей Хақанұлы Марғұлан) ушёл из жизни 14 января 1985
                        года в Алма-Ате, Казахская ССР, СССР. Ему было 80 лет на момент его смерти. Однако,
                        его научный вклад в археологию и этнографию остаётся значимым и ценным для Казахстана
                        и всего мира1. Алькей Хаканович Маргулан оставил след в истории, и его научные
                        достижения продолжают вдохновлять поколения учёных и исследователей.
                      </p>
                    </li>
                    <li class="chapter__sub-content-item">
                      <h5 class="chapter__sub-content-title">
                        Влияние его наследия на последующие поколения ученых и исследователей.
                      </h5>
                      <p class="chapter__sub-content-text">
                        Наследие Алькея Хакановича Маргулана оказало значительное влияние на последующие
                        поколения ученых и исследователей. Его работы в области археологии, этнографии,
                        истории и культуры Средней Азии стали важным источником знаний для многих ученых.
                        Маргулан внес существенный вклад в изучение и сохранение культурного наследия этого
                        региона, его исследования стали отправной точкой для многих последующих исследований в
                        этой области. Его методы и подходы к научной работе, а также его научное наследие,
                        вдохновили многих молодых ученых на исследования в области археологии, этнографии и
                        истории. Его публикации и работы по-прежнему являются объектом изучения и источником
                        вдохновения для новых поколений ученых, и его научные идеи и открытия продолжают
                        влиять на развитие научных знаний о Средней Азии. Кроме того, его вклад в общественные
                        дела и культурную жизнь региона также оказался значимым. Многие исследователи и
                        культурные деятели по-прежнему обращаются к его работам и методам в своей
                        деятельности. Таким образом, наследие Алькея Хакановича Маргулана продолжает жить и
                        вдохновлять новые поколения ученых и исследователей.
                      </p>
                    </li>
                  </ul>
                </li>
              </ul>
            </li>
          </ul>
        </div>
      </div>
    </div>
  </section>
</template>

<script>
export default {
  name: 'YourComponent',

  // Логика компонента Vue
  mounted() {
    // Находим все кнопки переключения подразделов
    var toggleButtons = document.querySelectorAll('.chapter__sub-title')

    // Добавляем обработчики события клика для кнопок переключения подразделов
    toggleButtons.forEach(function (button) {
      button.addEventListener('click', function () {
        var content = this.nextElementSibling
        content.classList.toggle('open')
      })
    })

    // Находим все заголовки разделов и блоки секций
    var titles = document.querySelectorAll('.chapter__title')
    var blocksHeaders = document.querySelectorAll('.works__container-h3')

    // Добавляем обработчики события клика для заголовков разделов и блоков
    titles.forEach(function (title) {
      title.addEventListener('click', function () {
        var chapterItem = this.closest('.chapter__item')
        if (chapterItem) {
          var subList = chapterItem.querySelector('.chapter__sub-list')
          if (subList) {
            subList.classList.toggle('open')
          }
        }
      })
    })

    blocksHeaders.forEach(function (header) {
      header.addEventListener('click', function () {
        this.classList.toggle('open')
      })
    })
  }
}
</script>

<style lang="scss"></style>
