<template>
  <section class="brief-biography" id="brief-biography">
    <div class="main-wrapper">
      <h2><span>Краткая биография</span></h2>
      <div>
        <div class="works__container">
          <ul>
            <li>
              Алькей Хаканович Маргулан (11 мая 1904 года – 12 января 1985 года) - выдающийся казахский
              ученый, который сыграл важную роль в развитии научной мысли в Казахстане. Родившись в селе
              Баянаул Павлодарской области, он получил среднее образование и начал свою учебу в
              Семипалатинском педагогическом техникуме. Впоследствии Маргулан продолжил обучение в Ленинграде,
              где завоевал высшее образование по специальности "Востоковедение".
            </li>
            <li>
              Он был академиком Академии Наук Казахстана, а также заслуженным деятелем науки Казахской ССР.
              Его научные интересы охватывали широкий спектр областей, включая литературу, искусство,
              фольклор, археологию и этнографию казахского народа.
            </li>
            <li>
              Маргулан активно участвовал в археологических и этнографических экспедициях, сделавших
              значительный вклад в изучение истории и культуры Казахстана. Его научные труды были признаны
              важными для понимания и сохранения культурного наследия этой страны.
            </li>
            <li>
              Особое внимание Маргулан уделял изучению фольклора и мудрости казахского народа. Его работы о
              кор-кытах, абызах, жырау и других представителях народной культуры стали классикой научной
              литературы.
            </li>
            <li>
              В течение своей жизни Маргулан преподавал в вузах, публиковал множество научных статей и книг, а
              также активно участвовал в научных обсуждениях и конференциях. Его вклад в развитие науки и
              культуры Казахстана остается невероятно значимым и вдохновляет многих ученых и исследователей по
              сей день.
            </li>
          </ul>
        </div>
      </div>
    </div>
  </section>
</template>

<script></script>

<style></style>
